README.org
#+STARTUP: indent

* 作用
#+begin_verse
主要用于派生其它基于Flask的项目
#+end_verse
* 结构说明
#+begin_verse
1. dao: 数据库交互层
2. manager: 业务逻辑层,直接访问dao
3. ctrl: 控制层,与manager对接，业务逻辑控制
4. view: 视图层,与ctrl对接
5. proto: protobuf保存目录
   1. proto/xx 保存xx数据类型
   2. proto/vo/xx 保存xx数据类型的视图。也就是返回到前端的结构
6. submodules: git子模块保存目录
7. gproto: gRPC的proto保存目录。用于定义api。以子模块的方式引入该gproto
    如: git submodule add repo gproto。该repo的根目录中必须要有 api.proto 之后客户端使用api中调用的函数
    如需使用该gRPC服务，还应创建 xxx_clients 的仓库，在该仓库中同样需要引入该 repo
#+end_verse
* 使用说明
#+begin_verse
1. 更新子模块
#+end_verse
#+begin_src shell
  git submodule update --init --recursive
#+end_src

#+begin_verse
2. 启动服务
#+end_verse
#+begin_src shell
  ./test_run.sh
#+end_src
* 运行demo
#+begin_src shell
  git co demo && ./test_run.sh
#+end_src
#+STARTUP: indent
* 如何添加一个新的实体
#+begin_verse
1. 创建 /proto/XXX/new-x.proto: *cm* snippet
2. 创建 /proto/vo/XXX/new-x.proto: *cpvo* snippet
3. 创建 /dao/XXX/new-x.py: *cda* yasnippet
4. 创建 /manager/XXX/new-x.py: *cmn* yasnippet
5. 创建 /ctrl/XXX/new-x.py: *cct* yasnippet
6. 创建 /view/XXX/new-x.py: *cvi* yasnippet
#+end_verse
